; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v2)
		(pred_4 ?v3)
		(pred_2 ?v8)
		(pred_3 ?v8)
		(pred_5 ?v3 ?v8)
		(pred_6)
		(pred_1 ?v3))

   (:action op_3
       :parameters  (?v4 ?v6)
       :precondition (and (not-eq ?v4 ?v6) 
                          (pred_2 ?v4) (pred_2 ?v6) (pred_3 ?v4))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v4))))


   (:action op_1
       :parameters (?v5 ?v1)
       :precondition  (and  (pred_4 ?v5) (pred_2 ?v1)
			    (pred_5 ?v5 ?v1) (pred_3 ?v1) (pred_6))
       :effect (and (pred_1 ?v5)
		    (not (pred_5 ?v5 ?v1)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v5  ?v1)
       :precondition  (and  (pred_4 ?v5) (pred_2 ?v1)
			    (pred_1 ?v5) (pred_3 ?v1))
       :effect (and (pred_5 ?v5 ?v1)
		    (pred_6)
		    (not (pred_1 ?v5)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_01 obj_06 obj_04 obj_07 obj_05 
          obj_08 obj_02 obj_03 
)
(:init
(pred_2 obj_01)
(pred_2 obj_06)
(pred_2 obj_04)
(pred_2 obj_07)
(pred_2 obj_05)
(pred_4 obj_08)
(pred_4 obj_02)
(pred_4 obj_03)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(pred_6)
(pred_5 obj_08 obj_05)
(pred_5 obj_02 obj_06)
(pred_5 obj_03 obj_04)
(pred_3 obj_05)
)
(:goal
(and
(pred_5 obj_08 obj_07)
(pred_5 obj_02 obj_05)
(pred_5 obj_03 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_08 obj_07) (pred_3 obj_01))
    (sometime-before  (pred_5 obj_02 obj_05) (pred_3 obj_01))
    (sometime-before  (pred_5 obj_03 obj_05) (pred_3 obj_01))
  )
)
)

; plan
1. (op_3 obj_05 obj_06)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_06)
   goals met: 0 of 3
2. (op_1 obj_02 obj_06)
   deleted: (pred_5 obj_02 obj_06) (pred_6)
   added: (pred_1 obj_02)
   goals met: 0 of 3
3. (op_3 obj_06 obj_07)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_07)
   goals met: 0 of 3
4. (op_2 obj_02 obj_07)
   deleted: (pred_1 obj_02)
   added: (pred_5 obj_02 obj_07) (pred_6)
   goals met: 0 of 3
5. (op_3 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_04)
   goals met: 0 of 3
6. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03 obj_04) (pred_6)
   added: (pred_1 obj_03)
   goals met: 0 of 3
7. (op_3 obj_04 obj_01)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_01)
   goals met: 0 of 3
8. (op_2 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_5 obj_03 obj_01) (pred_6)
   goals met: 0 of 3
9. (op_3 obj_01 obj_07)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_07)
   goals met: 0 of 3
10. (op_1 obj_02 obj_07)
   deleted: (pred_5 obj_02 obj_07) (pred_6)
   added: (pred_1 obj_02)
   goals met: 0 of 3
11. (op_3 obj_07 obj_05)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_05)
   goals met: 0 of 3
12. (op_2 obj_02 obj_05)
   deleted: (pred_1 obj_02)
   added: (pred_5 obj_02 obj_05) (pred_6)
   goals met: 1 of 3
13. (op_1 obj_08 obj_05)
   deleted: (pred_5 obj_08 obj_05) (pred_6)
   added: (pred_1 obj_08)
   goals met: 1 of 3
14. (op_3 obj_05 obj_07)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_07)
   goals met: 1 of 3
15. (op_2 obj_08 obj_07)
   deleted: (pred_1 obj_08)
   added: (pred_5 obj_08 obj_07) (pred_6)
   goals met: 2 of 3
16. (op_3 obj_07 obj_01)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_01)
   goals met: 2 of 3
17. (op_1 obj_03 obj_01)
   deleted: (pred_5 obj_03 obj_01) (pred_6)
   added: (pred_1 obj_03)
   goals met: 2 of 3
18. (op_3 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 2 of 3
19. (op_2 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_5 obj_03 obj_05) (pred_6)
   goals met: 3 of 3
